# Basic Sql Queries

In [1]:
import pandas as pd
import pandas.io.sql as sqlio
import psycopg2

conn = psycopg2.connect("dbname=northwind user=postgres password=password host=localhost port=5433")

![northwind](northwind.png)

###  Display all columns in the Region table

In [2]:
sql = """
SELECT * 
FROM region
"""

data = sqlio.read_sql_query(sql, conn)
data.head()

   RegionID RegionDescription
0         1           Eastern
1         2           Western
2         3          Northern
3         4          Southern

### Select the CompanyName and ContactName columns from the Customers table

In [3]:
sql = """
SELECT "CompanyName", "ContactName"
FROM customers
"""

data = sqlio.read_sql_query(sql, conn)
data.head()

                          CompanyName         ContactName
0                 Alfreds Futterkiste        Maria Anders
1  Ana Trujillo Emparedados y helados        Ana Trujillo
2             Antonio Moreno Taquería      Antonio Moreno
3                     Around the Horn        Thomas Hardy
4                  Berglunds snabbköp  Christina Berglund

###  Display table of those products that are between the ages of 10 and 20

In [4]:
sql = """
SELECT "ProductName", "UnitPrice"
FROM products
WHERE "UnitPrice" BETWEEN 10 and 20
"""

data = sqlio.read_sql_query(sql, conn)
data.head()

     ProductName  UnitPrice
0           Chai      18.00
1          Chang      19.00
2  Aniseed Syrup      10.00
3   Genen Shouyu      13.00
4        Pavlova      17.45

### Display  the names of employees and sort by their hire date from earliest to latest.

In [5]:
sql = """
SELECT "LastName", "FirstName", "HireDate"
FROM employees
ORDER BY "HireDate" 
"""

data = sqlio.read_sql_query(sql, conn)
data.head()

    LastName FirstName    HireDate
0  Leverling     Janet  1992-04-01
1    Davolio     Nancy  1992-05-01
2     Fuller    Andrew  1992-08-14
3    Peacock  Margaret  1993-05-03
4   Buchanan    Steven  1993-10-17

### Display a table  of the top 5 most expensive products

In [6]:
sql = """
SELECT * 
FROM products
ORDER BY "UnitPrice" desc
LIMIT 4
"""

data = sqlio.read_sql_query(sql, conn)
data.head()

,ProductID,ProductName,SupplierID,CategoryID,QuantityPerUnit,UnitPrice,UnitsInStock,UnitsOnOrder,ReorderLevel,Discontinued
0,38,Côte de Blaye,18,1,12 - 75 cl bottles,263.50,17,0,15,0
1,29,Thüringer Rostbratwurst,12,6,50 bags x 30 sausgs.,123.79,0,0,0,1
2,9,Mishi Kobe Niku,4,6,18 - 500 g pkgs.,97.00,29,0,0,1
3,20,Sir Rodney's Marmalade,8,3,30 gift boxes,81.00,40,0,0,0

### Display a table products based on following criteria:  The product must be in stock and supplier ID is either between 1 and 5 or supplier id = 10.

In [7]:
sql = """
SELECT * 
FROM products
WHERE "UnitsInStock" != 0 
AND ("SupplierID" BETWEEN 1 and 5 or "SupplierID" = 10)
"""

data = sqlio.read_sql_query(sql, conn)
data.head(10)

,ProductID,ProductName,SupplierID,CategoryID,QuantityPerUnit,UnitPrice,UnitsInStock,UnitsOnOrder,ReorderLevel,Discontinued
0,2,Chang,1,1,24 - 12 oz bottles,19.0,17,40,25,1
1,3,Aniseed Syrup,1,2,12 - 550 ml bottles,10.0,13,70,25,0
2,4,Chef Anton's Cajun Seasoning,2,2,48 - 6 oz jars,22.0,53,0,0,0
3,6,Grandma's Boysenberry Spread,3,2,12 - 8 oz jars,25.0,120,0,25,0
4,7,Uncle Bob's Organic Dried Pears,3,7,12 - 1 lb pkgs.,30.0,15,0,10,0
5,8,Northwoods Cranberry Sauce,3,2,12 - 12 oz jars,40.0,6,0,0,0
6,9,Mishi Kobe Niku,4,6,18 - 500 g pkgs.,97.0,29,0,0,1
7,10,Ikura,4,8,12 - 200 ml jars,31.0,31,0,0,0
8,11,Queso Cabrales,5,4,1 kg pkg.,21.0,22,30,30,0
9,12,Queso Manchego La Pastora,5,4,10 - 500 g pkgs.,38.0,86,0,0,0